Repository: uniwue-rz/uw_a11y_check
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# module.index
source: Manual accessibility check
de: Test Barrierefreiheit

# module.results
source: Accessibility check results
de: Test Barrierefreiheit - Ergebnis

# title.index
source: Accessibility Check
de: Test Barrierefreiheit

# title.checkResults
source: Accessibility Check - Results
de: Test Barrierefreiheit - Ergebnis

# labels.preset
source: Preset
de: Vorlage

# labels.start
source: Start tests
de: Tests starten

# labels.backToIndex
source: Back to index
de: Zurück zur Übersicht

# labels.impact
source: Impact
de: Auswirkung

# labels.help
source: Help
de: Hilfe

# labels.helpUrl
source: Help URL
de: Hilf-URL

# labels.contentElementUid
source: Contentelement UID
de: Inhaltselement UID

# labels.openCheckUrl
source: Open checked URL in new window
de: Geprüfte URL im neuen Fenster öffnen

# labels.acknowledgeResults
source: Delete results
de: Ergebnisse löschen

# image-alt.description
source: Ensures <img> elements have alternate text or a role of none or presentation
de: Stellt sicher, dass <img> Elemente über einen alternativen Text oder über die Rolle "none" oder "presentation" verfügen

# image-alt.help
source: Images must have alternate text.
de: Bilder müssen einen alternativen Text haben

# link-name.description
source: Ensures links have discernible text
de: Stellt sicher, dass Links über einen erkennbaren Text verfügen

# link-name.help
source: Links must have discernible text
de: Links müssen einen erkennbaren Text haben

# link-name-blacklisted.description
source: Ensures a link name or linked image alt/title attribute does not equal a blacklisted word
de: Stellt sicher, dass der Linkname, der Bild alternative Text oder der Bildtitel nicht zugelassen ist

# link-name-blacklisted.help
source: The link name or the title/alt of a linked image equals a blacklisted word. Current Blacklist:
de: Der Linkname, der Bild alternative Text oder der Bildtitel ist nicht zugelassen. Aktuell nicht zugelassene Wörter:

# redundant-title.description
source: Ensures title attribute text is not the same as text or alternative text
de: Stellt sicher, dass der Titel und der alternative Text eines Bildes nicht gleich ist

# redundant-title.help
source: The title attribute value is used to provide advisory information. It typically appears when the users hovers the mouse over an element. The advisory information presented should not be identical to or very similar to the element text or alternative text.
de: Der Titelattributwert wird verwendet, um zusätzliche Informationen zu einem Bild bereitzustellen. Es sollte nicht mit dem alternativen Text übereinstimmen.

# redundant-link.description
source: Ensures links with the same location have different names
de: Stellt sicher, dass Links zum gleichen Ziel ein unterschiedlichen Namen haben

# redundant-link.help
source: For a keyboard user, it is tedious to navigate through redundant links. For users of assistive technologies, it can be confusing to encounter successive identical links. When the text alternative for the icon is a duplicate of the link text, it is repetitive as screen readers read the description twice.
de: Bei der Benutzung einer Tastatur ist es störend, wenn Links den gleichen namen haben.

# heading-order.description
source: Ensure headings are in a logical order
de: Stellt sicher, dass die logische Reihenfolge der Überschriften eingehalten wird

# heading-order.help
source: Headings must be in a valid logical order, meaning <h1> through <h6> element tags must appear in a sequentially-descending order.
de: Die logische Reihenfolge von Überschriften muss eingehalten werden. Dieses bedeutet, dass <h1> bis <h6> Überschriften in absteigender Reihenfolge dargestellt werden.

# savedResults.title
source: Saved results exist
de: Gespeicherte Test-Ergebnisse vorhanden

# savedResults.message
source: The database contains %s saved check results created by an automated check. It is advised to review the check results.
de: Es sind %s gespeicherte Test-Ergebnisse von automatisierten Tests vorhanden. Es wird empfohlen diese zu prüfen.

# savedResults.review
source: Review check results
de: Ergebnisse prüfen

# result.title.0
source: Test passed
de: Test bestanden

# result.title.1
source: Test failed with violations
de: Test nicht bestanden

# result.title.2
source: No elements found for test
de: Keine Elemente für Test gefunden

# result.title.3
source: Test failed with errors
de: Test aufgrund von Fehlern fehlgeschlagen

# result.impact.1
source: None
de: Keine

# result.impact.2
source: Minor
de: Gering

# result.impact.3
source: Moderate
de: Mäßig

# result.impact.4
source: Serious
de: Schwerwiegend

# result.impact.5
source: Critical
de: Kritisch
